{"pages":[{"title":"","permalink":"http://witforest.cn/404.html","text":"你访问的内容不存在！"},{"title":"About","permalink":"http://witforest.cn/about/index.html","text":"重度拖延癌，总是控制不住欲望，对自己没有计划的loser。 健身，读书，空闲时可以看看综艺节目，欢迎大家监督~ 微博：@零度开水_z &nbsp;&nbsp;微信：zerowater_z &nbsp;&nbsp; 邮件：admin@witforest.cn"},{"title":"Home","permalink":"http://witforest.cn/home/index.html","text":""},{"title":"归档","permalink":"http://witforest.cn/archives/index.html","text":""},{"title":"邻居","permalink":"http://witforest.cn/links/index.html","text":"设计jj.lin - We can control our destiny. 癖事 - 让美好的事物永久保鲜。 技术木木木木木 - 不问明天，悠然浪费。 Fatesinger - 一期一会。 牧风 - 呼吸妹子的气息。 咚门 - 她微笑关了窗。 MASTER - HELLO,WORLD. 二毛 - 一个水笔程序员。 Recordmind - 暂无。 Fazero - 觉今是，而昨非。 末夏夏末 - 一个伪文艺非技术宅。 北落师门 - 山有木兮木有枝，心悦君兮君不知。 文字上尉·詩人 - 趁年轻，别对不起自己儿时吹过的牛逼。 酒衫 - 迷途漫漫，终有一归。 素锦 - Guo.Lu。 吴先生·型男志 - 略。 千弦月 - 静静的夜，思绪停止飞~ Xinsenz茶话 - 生命在于折腾！记录点滴生活。石の上にも三年！ 夜枫忆栈 - 暂无 盐酸小姐 - 没有人像我一样。 VATVE·梵缔威 - 青春献给互联网。"},{"title":"历程","permalink":"http://witforest.cn/history/index.html","text":""},{"title":"Categories","permalink":"http://witforest.cn/categories/index.html","text":""},{"title":"音乐","permalink":"http://witforest.cn/music/index.html","text":"[nm][/nm]"},{"title":"Tags","permalink":"http://witforest.cn/tags/index.html","text":""},{"title":"留言簿","permalink":"http://witforest.cn/guestbook/index.html","text":""}],"posts":[{"title":"读《把时间当做朋友》有感","permalink":"http://witforest.cn/2017/12/31/make-friends-with-time/","text":"10月的时候无聊，抓起这本刚到成都入职培训时公司为全体新员工赠送的《把时间当做朋友》进行捧读。第一眼就吸引我的是这本书萌萌的插图。读完整本书，我能够感觉到李老师也是一个语言极度温柔，在生活中应该就是那种特别平易近人的吧。后来上豆瓣看这本书的书评时，无意发现了李老师的个人网站。，竟然也是用的hexo哈哈。看到了半边头像，不得不说和想象之中差别超级大，也许跟他在书中透露的健身经历有关吧。下面是真正的干货咯！读完这本书，我记下了58句话，还有两句是我自己加的。（与原文有细微差别的未做标示，如有问题，还请指正） 1.要管理的不是时间，而是自己 2.要有良好的心智，做出尽可能准确的判断，用正确的方式做正确的事情 3.任务都有最后期限，并在不断迫近 4.人们更愿意相信自己拥有一定的判断能力 5.时间不够了，是我们自身原因，要靠积累去解决 6.我们可以用自己的大脑控制自己的大脑 7.将自己的思考作为思考对象的能力称为元认知 8.做大脑的主人 9.心智是一个人获得的一切知识及经验的总和 10.你想要什么，他偏不给你。用好你拥有的，积累到一定时候再换取能换的东西 11.想我要什么的时候也要想想我有什么 12.时间，精力，正常的智商加上努力，勤奋，机会总会有的 13.接受不完美的事，坚持做到更好 14.焦虑是导致时间浪费、效率低下的根源之一 15.遇到难以解决的问题时先记录下来 16.心怀梦想的时间越长，它的沉没成本就越高 17.学会接受现状，用好手上的资源，热爱自己的生活 18.正确的事是现实的 19.速成绝无可能、付出才有收获、完美永不存在、未知永远存在、现状无法马上摆脱 20.真正的问题都是你没有想到的 21.分辨任务的属性，熟悉的还是陌生的 22.没必要在意来自他人的非建设性负面评价 23.接受惩罚往往是积累经验的起点，挫折教育 24.任何任务的绝大部分都是枯燥而又无趣的 25.在做任何事情之前，通过关注“方法”去反复拆分任务，最终确认每个子任务都是可完成的 26.机械任务搭配非机械任务 27.选择性输入机制 28.学习并不是一下子突飞猛进 29.权威不是用来迷信的，而是辅助我们认识世界 30.思考任务的目标，实质，意义，从而思考方法 31.错误归因 32.双盲测试 33.相关命题 34.举证责任 35.诉诸无知 36.从别人那里知道一个结论的时候，自己动脑重新推演一遍，看看得出结论的过程有没有漏洞和不合理的地方，衡量一下结论到底有没有道理 37.脑子混乱的人主要特点是把不是一回事的东西当做一回事 38.时间管理和自我管理 39.用案例说明结论时，要时刻注意逻辑关系，尽量避免以偏概全 40.运用心智意识到对立论证的存在，接受更合理，更现实的一个 41.认知偏差和自利性偏差 42.克服恐惧，强与弱才是自然界中真正存在的本质 43.过去的事情是无法更改的，现在的烦恼是无济于事的 44.语言是是思考的辅助工具，规范自己的需要有利于形成正确的思考 45.有效倾听首先要克制过早质疑 46.在倾听过程中，可以处理回顾和预期两方面的信息 47.往往不是有兴趣才能做好，而是做好了才有兴趣 48.方法很重要，但是和“用功”相比，方法几乎可以忽略不计 49.比成功更重要的是成长 50.“努力”相对于另外两个因素—出身和运气—是最无足轻重的。 51.承认自己能力有限，是保持心理健康的前提。 52.集中精力改变那些自己能够改变的事情，暂时忽略那些自己不能改变的事情。专心打造自己，让自己成为一个优秀的人，一个有用的人，一个独立的人。 53.谦虚和低调是一种自我保护的优化策略 54.“博学”背后的真相是有意识的积累 55.任何人都不可能100%地有效率，至少不能总是100 56.凡是值得做的事情，都值得慢慢去做，做很久很久 57.学会控制大脑，做非常重要但可能并无乐趣的事情 58.愿我能从容接受我不能改变的，敢于改变我可以改变的，也愿我有智慧分辨这两者间的区别 59.思想就是武器，能说就是火力。看过奇葩说的应该都知道这句话，看完书最大的感想就是，一个人原来真的可以想这么多杂七杂八的。那些说要让自己的想法简单点，简简单单生活或许真的是很难达到的地方吧。而且即使最终能过上那种生活，怎么可能不经过硝烟弥漫的“战争时期”呢。所以，不要刻意去简单化自己的想法，一时想不通的就不要想着马上就解决好了吧。一定一定一定要做一个思想丰富的人！ 60.思行合一。这本书通过困境、醒悟、现实、管理、学习、思考、交流、应用、积累这几方面对心智的成长进行了论述。如果站在我们的角度的话会觉得都是作者在给我们灌输思想，但是若我们能转换角色，站在作者的角度，其实就会发现这是一个思考和实践相互伴随的过程，你需要不断思考然后不断进行实践论证然后修正… 也许光把一本书里面自己觉得有意思/有用的东西抄写一遍根本没用，重要的是在实践中去进行验证的过程，只有这样最后才能形成自己的行为风格。 最喜欢的是成长比成功重要，还有后半句来自粉笔张小龙：发展比拥有重要。 不论别人如何评价，我始终觉得这本书对我来说是十分有益的，尽管看到的那些方法并没能够完全应用到生活中，但是它至少让我看到了更多有趣的事情~书上的道理也许就是当你迷茫的时候，可以拿出来看一看，一来可以打发时间，二来真的可以提高自己！ 后记：这是我第二本完整看完的书，第一本是高三期间看的《看见》，虽然读的很慢，但是真正用心读的时候也确实在想着完全去理解作者的感情吧。希望下一本书可以不用看的这么久~"},{"title":"苹果手机越狱了要怎么玩？","permalink":"http://witforest.cn/2017/12/09/jailbreak-your-iPhone/","text":"越狱和root几乎是我拿到手机首先要关注的事情。为什么要越狱？最开始的时候是为了下载收费软件，还有显得自己的手机和其他人不一样。现在越狱对我来言，代表着无限的可能性。（一边说着选择太多不好，一边又渴望着无限的可能性。人生也许就在这样不断自己打自己脸的过程中慢慢消逝吧，anyway，开心就好。） 如果你也想感受越狱的魅力，那不妨看看本文~ 首先当然要有一部能够越狱的ios设备，越狱的一手信息可以关注两个网站：Reddit和Twitter。Reddit网站里面有一个jailbreak板块，里面暗藏着许多大牛，会第一时间把他们的研究成果发表出来。Twitter上面也是如此，准确的说Reddit上的消息一般也是从Twitter上面搬运过去的，所以多去Twitter上关注一些大牛吧。 翻墙和怎么找到越狱开发的大牛我就不详细说了，如果你感觉有困难的话，那最好就此打住了，虽然最近国人发布了几次越狱，但是ios最核心的技术linux还是用英文编写的，所以一定的英语基础和翻墙手段也是必要的。 好了，前面的关卡都没有难住你，你已经可以随时随地了解越狱社区的最新动态，那我们就可以开始愉快的玩耍了。本文主要是推荐一些个人很喜欢的插件~ 插件名 用途 Activator: 1.9.12 手势插件，自定义手势操作 BatteryLife 电池信息: 1.7.0 查看电池信息，更改电池显示方式 BytaFont 3 第三方字体平台: 3.1.5 更换字体 CallBar (iOS 10/9/8/7): 1.3-169 来电时显示一个小窗口而不是全屏 ClassicFolders 2: 2.0.4k 改变文件夹视图 CyDown: 6.8.4 破解cydia下载收费 DeleteForever 永久删除照片: 0.0.1-59 Don’t Stop The Party!: 0.0.2 respring时不会停止播放音乐 ExactTime: 1.3 显示通知的具体时间，不会变成半小时前之类 Filza File 文件管理器: 3.4.0-25 Flame: 1.3 自定义cydia商店 Flex 3 程序修改器: 3~EarlyAccess2 FlipControlCenter: 1.0.4 更换控制中心 GIFRoll 原生GIF动图: 1.0 GoodWiFi: 0.0~beta2 可以查看网络的详细信息 iCleaner Pro 系统清理: 7.6.1~beta1 Illustrated Resprings: 1.0 几款respring的动画 Liberty 屏蔽越狱检查，比xcon强大 KuaiDial (iOS 7/8/9): 1.0.1a2-13 拨号强化 MakeRespringsGreatAgain: 1.4 respring时显示logo NFCWriter 激活原生NFC: 0.1-115 NtSpeed 悬浮网速: 0.2~beta3 onion: 0.0.5 控制中心细腻化 PreferenceOrganizer 设置归类: 3.6 ScreenshotXI: 1.0-4 ios11风格截图 Sonus: 3.0.2-3 音量调节界面 Stashing for iOS 9.2 - 10.2【容量修正】: 1.4.9 StatusPeek 2 (iOS 10): 2.0b 下拉显示状态栏信息 SwipeExpander 强大的键盘增强: 1.0.11-1 原生键盘增加上滑输入 SwipeForMore 智能滑动增强: 1.1.7 cydia增加滑动快捷操作 SwipeSelection Pro: 1.0.3-1 原生键盘直接滑动移动光标，不用按下3d touch System Info: 1.2.0 关于本机显示更多信息，支持直接备份shsh Thumbtack: 1.0.0 便签增加置顶功能 Tumblr视频下载: 1.1 Tweak Cnt 插件数量统计: 1.0.1 Unify: 1.1.3.2k 合并消息通知 本列表按首字母排序（由Flame插件导出），不代表推荐程度。还有很多插件是我安装使用一段时间后又删掉了，所以没有出现在列表里。目前手机系统是10.1.1，越狱崩溃的次数非常少，话说偶尔遇到一次也挺麻烦，所以玩越狱还要有比较好的承受能力和解决问题的能力啦~我个人比较喜欢选择那种隐形增加ios功能的插件，别人一眼看不出来你的iPhone越狱了，但是拿到手上一用，会被无数的小功能惊讶到。而且我发现许多引起设备崩溃重启的插件都是与界面有关系的。 如果这个列表里面有你没有使用过的软件，那你一定要试试了。最近新出了一个控制中心插件Maize，使用过一段时间，也相当不错，只是我觉得通过几个插件来模拟ios11的体验还是不够纯粹）。可以考虑更新手上的设备以更好地体验ios11，并且最近ios11.1.2以下系统的设备应该也会迎来越狱了~ 要及时获得最新的插件信息的话还是要多关注越狱社区的动态信息了，因为Reddit基本上是大多数插件作者发布信息的一手平台。我基本上也只是安装了几个大的插件源，最新的插件动态还是时刻关注得到的。 如果你有啥好玩的插件记得在留言里面告诉我哟，我一定会去尝试一下。"},{"title":"我敢在你怀里孤独","permalink":"http://witforest.cn/2017/11/26/i-dare-to-be-lonely-in-your-arms/","text":"我敢在你怀里孤独。 看到书名第一想法以为是同床异梦那种震惊三观的故事。那真是怕怕的。 室友整理书桌时拿给我看的书。我想它出现的刚刚好，这个时候读这本书是再合适不过了的。 书里当然没有我以为的颠覆三观的狗血剧情，也没有心灵鸡汤或者伪心灵鸡汤，也不能算是自述的书。这本书是奶茶对于“独处”的一些想法以及她与陈绮贞、五月天石头等8位朋友的“对话”，也许这算不上我喜欢看的书的类型，但是偶尔换换口味，也别有一番风味。 以前喜欢奶茶，是因为她的歌，“后来 我总算学会了如何去爱 可惜你早已远去消失在人海…”、“谁让我拥抱 谁让我疯狂的心跳…” 带着一点点怀念和伤感，我有时候就是喜欢一个人静静的听这种有着淡淡忧郁的歌，假装深情和浪漫。我听她的歌，喜欢她，认为她是一个有故事的人。看了她的书，我想我又多喜欢她一点了，是一个有很多自己想法和思想的女性。温润如玉，知性大方，全部是我喜欢的模样。 &lt;一&gt;孤独 = 悲伤、无奈、无助？ 不，孤独是一种状态。寂寞才是一种负面情绪。 以前上大学，我有点不太理解室友喜欢一个人去图书馆，那时候觉得大家一起多好，有人陪着闹着。后来一个人去看书，去吃饭，现在反而有点喜欢了。一个人的行动会更加自在安逸和有效率些。 就像这样在一个阳光温暖的午后，提着电脑坐在图书馆四楼靠窗的单人桌上，偶尔看看齐窗的树梢上来回扑腾的飞鸟，偶尔看杂书看的乏味了就抬抬头，满眼的绿色和碧静的蓝天，自如自在，心也静了。 我想我真的开始喜欢独处了。但是也许就在一周前，我还是一个害怕孤独的人。是那个每天都要在吃完饭回宿舍必须独处的路上，给某只打电话，要找个人来陪我一下的长不大。现在觉得也没什么啦，It’s okay，totally。 一个人去旅行，一个人去KTV，一个人去逛街。有机会都要尝试一下，期待遇见不一样的自己。(下一秒的内心：不要给我这样的机会，嗯？) 享受孤独，不管是在喧嚣的大街还是寂静的一隅，让自己的状态是独立的。 自在独处，身心独立。 &lt;二&gt;“有些人总喜欢跟自己较劲，而有些人愿意让自己停留在他们想要的世界里。” 我可能是前者。 最近发生了一些怪怪的事情，我也说不清楚。我听从心的声音，做了一些不理性的决定。但是后来伤心的时候，我自己也分不清是哪一件事更让我心痛。我怪自己。但是，这一天迟早要来，不是吗？ 诚实面对自己，是需要更多的残忍，伤人也伤自己。 “我不是不喜欢，是我不敢想拥有，好像拥有就成为一种负担，拥有就必须准备好失去。” 有时候越害怕什么，什么就会来得越快。这好像正如墨菲定律，面包掉在地上或咖啡打翻的次数，会跟地毯的昂贵程度成正比。（现在看到有意思的比例关系都想跑个回归验证一下。笑） 躲在被窝里。不吃饭也不出去。想了很久很久，想清楚了。对自己糟糕的状态很失望，但是有些事有些人会让你更失望。哈哈哈。痛苦的时候把自己看小点就好了。人都会习惯性的自我膨胀，痛苦的时候更甚，眼中的任何事物都是痛苦，把自己膨胀成了全世界。沧海一粟，吾生须臾，学会转移注意力。人不要和自己过不去。 &lt;三&gt;选择？ “年少时候的选择只需燃烧热情，现在什么选择都是意志力的磨练。但自始自终，选择不难，是勇于面对难。” 选择真是让人头疼的问题。但实际上我们每天都在做着选择，早上吃什么，中午吃什么，晚上吃什么等等琐碎的事情。如果你上车之后发现买错票，你会选择马上叫司机停车还是选择什么都不管坐到哪儿下就下顺便欣赏沿途的风景呢。 我不知道，我可能会选前者吧，性子急的人走错地方了根本无心看风景，但是如果司机停不了车，这根本无法选择了，假设不成立！那也只能接受这个结果咯。 所以有时候换过来想想，不要纠结于自己选择的对错，没那么多对错，永远去享受自己的选择。酸甜苦辣都是滋味儿。 &lt;四&gt;结尾就借一个傻逼朋友的一句话好了，模模糊糊，恍如隔世。 漫长的一周又过去了，就当风没吹过，云也没有来过。 Less is more. THE END. 作者：机灵de小妖 简书链接：我敢在你怀里孤独"},{"title":"《摆渡人》读后感","permalink":"http://witforest.cn/2017/11/25/review-of-see-you-tomorrow/","text":"广州的秋天总是会来的晚一些。 当落叶积在小道越来越多时，秋天来了。 “明知不会有结果依旧想要拼命付出，如此难得却感人至深的情感，因为少见所以珍贵。” 《摆渡人》。 他说，我之所以存在，是因为你需要我。 如果说生命是一条河流，那谁又会是我们灵魂的摆渡人呢。 他带你穿过荒无人烟无边无际的荒原，他在你最无力的时候承诺一定保护好你一定不丢下你，他拉着你奔跑后来留下来只身抵挡成千上万只恶魔直到确认你进了安全屋，你告诉自己这一切只是在他迎合只是他在履行他日复一日的职责，不知道他也在情感和理性中反复挣扎。是的他说谎了，说爱你是真的，希望你跨过荒原也是真的，要你安全到另一个世界才是他最大的心愿。他不愿意改变，准确地说，他害怕改变。你不知道他都不愿意牵下一个灵魂的手，他没有变成下一个灵魂喜欢的模样，连叫玛丽的名字反复萦绕在他脑海里的都是你的样子和声音。 人们都说想要崔斯坦这样陪在身边的人。我却想对迪伦说，谢谢你，勇敢的迪伦。 崔斯坦不知道自己是谁，除了坚守摆渡人的职责，变成每一个灵魂信任的模样，他不知道自己是谁，不知道自己存在的意义。从一开始的单纯、热心到现在摆渡了无以计数个灵魂之后的冷漠麻木，一直到遇到迪伦，在这个简单执着勇敢的女孩身上回忆到了隐藏在内心的愧疚和温暖的人性。 如果说崔斯坦是迪伦的摆渡人，那迪伦又何尝不是崔斯坦的摆渡人呢。 在天堂和地狱之间的那片荒原是人心投射的心像。这片荒原的模样，是阳光明媚还是大雨倾盆，是一马平川还是山路泥泞，是狂风漫漫还是微风绵绵，全都取决于自己的心境。那些饥饿疯狂的恶魔，就是心魔啊。那人生，不也如是吗？我们都在形成和跨越自己人生的荒原，除了自渡，他人爱莫能助。 书里面最后一句，“原来你在这里。”“我在这里。” 老掉牙的台词和玛丽苏的结局，但是也多么惊喜和令人感动。 除了爱情的陪伴，挚爱的家人和心爱的朋友，都是最长情的陪伴。当你需要的时候，如你所愿，永远都在。 也恰好看了《一路有你》的电影。在关掉灯的礼堂里，时而大笑时而泪目。 看到了人们对传统文化的执念，看到了冲突与矛盾，也看到了沟通、理解和妥协，看到了人生的未知和变化无常，看到了乡愁和回忆，也看到了深刻的亲情、友情同学情和爱情。 因为相处而增进了解，也因为深爱，所以一切得到谅解和解决。华人传统的家庭幸福观和对家庭的责任感染和化解了西方的独立个人主义。“父慈子孝，妻贤女顺，儿孙满堂，老有所依，病有所探”看着影片里明显的对于传统幸福观的倾向，有一种满满的归属感和自然力量。看到全叔他们竭力完成朱校未实现的梦想那一段，无言的感动。执着，有时让人讨厌有时让人敬佩。 带着某些偏见，我们拒绝了很多东西。 有些没用的事就是要我们这些没用的人来做的。 BY @小官人小"},{"title":"《解忧杂货铺》读后感","permalink":"http://witforest.cn/2017/11/04/review-of-grief-grocery-store/","text":"有时伤害，有时相助，人们总是在不经意的时候与他人的人生紧密相随。 看于心慌意乱的十月末。深深的被东野圭吾大作家的逻辑感和精巧构思所折服。看到第二段时就舍不得放下书，想知道故事里的这些人他们是什么样的联系，带着猜测和丰富的想像，不到两天便看完了这本书。 全文围绕浪矢杂货店以及丸光孤儿院两条主线，与之相关的人与事件在时间的纵线上不可思议的贯穿相连，首尾呼应，像是画成了一个圆。五个看似独立的段落，实则处处埋下伏笔，有一种欲知后事如何，请看下个章节的感觉。令人感慨：缘，真是妙不可言。 与其说文章的主旨是解忧，不如说是爱与救赎。 从文章表面看，翔太、敦也、幸平三个小偷误打误撞进了浪矢杂货店，恰好是雄治逝去三十三周年之夜，这个夜晚是浪矢杂货店复活之夜。他们三个通过回信解决了“月兔”、“鱼店音乐人”、“迷途的小狗”各自的迷茫和烦恼。实际上，这也是他们自己各自的救赎。月兔，纠结于陪伴时日不多的患病男友以及奥运会训练，男友逝去，奥运会取消，但是她最后的选择没有留下遗憾。鱼店音乐人，纠结于继承鱼店还是继续走音乐之路，最后在火灾中因救一位小孩而牺牲，但是也因为他的歌《重生》成就了大音乐家小芹。太多的故事，不断在后文中慢慢浮现千丝万缕的联系。翔太，敦也，幸平这三个人也在解决别人的烦恼同时让自己的思想和人生回到正确的方向。而全文，一些小细节小故事处处体现着“情”，爱情友情亲情、陌生的熟悉的、久别重逢的一面之缘的，最简单的感情却也难能可贵。 心情浮躁、迷茫的时候，看看这些文字，总能平静一些。 “可是我自己做不到的事情，是不会要别人去做的。翔太，如果是你呢？你做得到吗？” “有人肯倾听烦恼就已经很感激了。” “他不知道说什么好，大脑自动拒绝思考。” “你爸希望你实现梦想。”加奈子说，“他不想耽误你，不想因为自己生病而让你放弃梦想。你和他聊聊可以，别忘了这一点。” （看到这一段是最感动的，我们的父母，总是倾尽所有为我们考虑） “其实若真正有才华，运气并不是那么重要。” “人的心声绝对不能无视的。” “这么多年咨询信看下来，让我逐渐明白了一件事。很多时候，咨询的人心里已经有了答案，来咨询只是想确认自己的决定是对的。” “正因为很费心思，做起来才有意义啊。” “你知道的只是冰山一角，事情的真相你恐怕一无所知。” “虽然至今为止的道路绝非一片坦途，但想到正因为活着才有机会感受到痛楚，我就成功克服了种种困难。” “人与人之间情断义绝，并不需要什么具体的理由。就算表面上有，也可能只是心已经离开的结果，事后编造出的借口而已。因为倘若心没有离开，当将会导致关系破裂的事态发生时，理应有人努力去挽救。如果没有，说明其实关系早已破裂。” “心一旦离开了，就再不会回来—” 一边看一边摘抄了一些语句。也很想把最后雄治爷爷的回信po出来： 以下这段话是给无名氏朋友：我用老头子的想法反复思索了你特地寄来一张白纸的理由。因为我觉得这一定是件很重要的事，不能随随便便地答复。我开动快要糊涂的脑筋想了又想，最后理解为，这代表没有地图。如果把来找我咨询的人比喻成迷途的羔羊，通常他们手上都有地图，却没有去看，或是不知道自己目前的位置。但我相信你不属于这两种情况。你的地图是一张白纸，所以即使想决定目的地，也不知道路在哪里。地图是一张白纸，这当然很伤脑筋。任何人都会不知所措。可是换个角度来看，正因为是一张白纸，才可以随心所欲地描绘地图。一切全在你自己。对你来说，一切都是自由的，在你面前是无限的可能。这可是很棒的事啊。我衷心祈祷你可以相信自己，无悔地燃烧自己的人生。我以后应该不会再回答烦恼咨询了。感谢你在最后问了一个很有价值的难题。 浪矢杂货店 我觉得最后这封信也正是作者送给我们读者的吧。 人生，或是突如其来的灾难，或是面临无法抉择的选择，或是不如意之事十有八九，有失意即也有快乐和幸福。如信中所说，【正因为是一张白纸，才可以随心所欲地描绘地图】。千万种可能，不管选择了哪一条路都是对的，因为努力了就有意义。 仔细斟酌文中每一封信，不管是寄信还是回信，都是认真、虔诚、且彬彬有礼的，也皆令人感动。现在这么耐心、真诚且善良的人啊，还有吗？别人会说他傻吧。 时间总会让一切事物变得越来越清晰。一段难以维持的感情，失去了也不觉可惜。以及一些多远都不会丢的人呀，在心里越来越近。 如果你有故事要和我分享，我一定仔细听。 BY @小官人小 2017.11.3 JNU"},{"title":"《月亮与六便士》读后感","permalink":"http://witforest.cn/2017/10/30/Review-of-the-moon-and-six-pence/","text":"距看完这本书实际上已经好几个月。潘同学问我近日是否有读杂书，我反思，自大四开学起浑浑度日已经很久没给自己充电了。问潘同学可有推荐，他说起自己刚读完这本《月亮与六便士》，深有感触。每日实习回来偶有时间便抽空看个几十页。 “满地都是六便士，他却抬头看到了月亮。”“文明社会这样消磨自己的心智，而短促的生命浪费在无聊的应酬上实在令人莫解。”“我想在过去的日子里我们都羞于使自己的感情外露，因为怕人嘲笑，所以都约束着自己不给人以傲慢自大的印象。我们对自己的一些荒诞不经的行为遮上一层保持体面的缄默，并不认为这是虚伪。”“我总觉得大多数人这样度过一生好像欠缺些什么。我承认这种生活的社会价值，我也看到了它的井然有序的幸福，但是我的血液里却有一种强烈的愿望，渴望一种更狂放不羁的旅途。”“因为人们过于看重别人对他的意见，过于害怕舆论对他的指责，结果自己把敌人引进大门里来。”“上帝的磨盘转动很慢，但是却磨得很细。”“为了使灵魂宁静，一个人每天要做两件他不喜欢的事情。” 查尔斯用自己的后半生，活成了他喜欢的模样。忘掉那些身份，忘掉世俗的眼光，忘掉恶意的猜测，他全然不顾，他只在乎自己对艺术的追求。 有人说二十岁的我们开始认识自己，三十岁的我们学会接受自己。晚上睡不着的时候我总是在思考人生的意义，第二天醒来，生活还如昨天一样的轨迹。即使是看完这本书这么久，我还是不能理解查尔斯的行为。如果我认识他，我要去问问他：老兄，你幸福吗？但是我知道他一定会回答我一句，关你屁事。 他在最后的日子，躺在自己宏伟巨作里。他说他死了，要连同这个满屋子的画一起烧去。他不在乎自己作品有没有人赏识，他不在乎一切贬低连同称赞也不在乎，他在艺术的纯粹里完成一场又一场与灵魂的对话，他是幸福的。 我不理解他，我不羡慕他，因为我对艺术没有追求。但是我其实也羡慕他，羡慕他的自由。至少我觉得我自己是，是不自由的，而这种不自由是我自己施与自己的。 我说我要留在家乡，可是我没有，我来了我不要来的广州。我说我不要读研，可是我极不情愿的读了，所以我要细心寻找属于这里的乐趣。 你什么时候能大胆点啊，去自己喜欢的地方，去做自己喜欢做的事情，去爱自己想爱的人。大概是不可能咯。 因为你连自己喜欢什么，都不能够说清楚。我们用尽全力，过了平凡的一生。但是，也许，平凡也挺好的。 BY@小官人小"},{"title":"博客的意义","permalink":"http://witforest.cn/2016/04/27/what-blog-means/","text":"生命中有很多有意义的事情，但是往往在你实践并认真思考过后，它的意义才会更清晰地展现在你眼前。我喜欢没事的时候就胡思乱想，所以就有了这篇文章。 最开始弄博客，是因为申请到了阿里云免费主机，反正不要钱的放着也是放着，有一天又偶尔逛到一个博客网站，记得是咚门的网站，第一眼就觉得这个东西高端简洁有内涵，正好自己高中也玩过网站，所以建设起网站来自然就是轻车熟路了。 首先，博客在很多方面提高了自己的技术。疯狂更换和折腾主题的过程中，不经意间就钻研了一些PHP，HTML，CSS的知识，加上在学校里面为社团架设网站更是了解到了JavaScript和很多好玩的东西。 第二个是在写博客的过程里面整理了很多自己的思路，把自己有时候偶尔的一个小点子进行了记录。现在回顾的时候觉得那些都是非常珍贵的东西，能够被记录下来感到特别的开心和自豪。 最后是认识了很多比自己牛逼，但是同样在过着平凡生活的大神。以前没事的时候会抱怨生活、社会不公平，觉得人生失去了意义。但是这群优秀的人让我感到惭愧，他们尚且在为了更好的生活奋斗，我哪有资格再一直这么懈怠呢。 感谢博客，感谢大神们。 Life is everyday,live hard."},{"title":"我关心的是我能得到什么","permalink":"http://witforest.cn/2016/04/22/i-just-care-myself/","text":"也许有的人看到这个标题会忍不住发出：“你这样可不好啊”，“这样太自私了”诸如此类的评论。 但我并不是要让谁满意，我只想让自己开心啊。 对于现在的我而言，这句话是迫切需要理解和实践的。因为我开始觉得自己累了，不再可以那么无私，不再可以那么不计较得失，我要开始为自己着想。 所以我会开始学习怎么去关心我能得到什么，我不要再当做好事不留名的活雷锋了，我要带着强烈的获取利益的目的去开始做很多事情。 “下次找我帮忙的时候，记得先发个红包吧”。对不起，我真的累了。因为这样的奉献太久过后，会开始觉得自己的劳动没有受到应有的尊重，在这个满目疮痍的世界上，如果得不到一点点的回响，是一件多么无聊和令人沮丧的事情啊。 身体倦了，休息片刻可以重新出发；心灵累了，再好的针法也无法缝合。 我已经下定决心做一个坏人了，就算是老天爷也不能改变。 再见了，曾经的自己。再见了，大好人！"},{"title":"想她","permalink":"http://witforest.cn/2016/03/21/miss-lillian/","text":"想跟她吵嘴 想惹她生气 想看她的笑 想跟她一起跑步 想听她爱听的歌 想吃她买的东西 想牵她的手 想吻她脸颊 想告诉她我多么想她 想告诉她我爱上了她"},{"title":"开始一段没有你的生活","permalink":"http://witforest.cn/2016/03/17/live-a-life-without-u/","text":"也许，人生本来就该是孤独的吧；太渴望摆脱孤独的时候，会以为能够跳出这个深洞；时间久了，还是会发现是自己在跟自己相处；所以，不如勇敢的去开始一段没有你的生活吧。"},{"title":"新学期，新开始，新期待","permalink":"http://witforest.cn/2016/03/09/new-term-new-start-new-target/","text":"已经三个月没有好好写点什么了，博客再继续这样下去的话，不在懒惰中死去也会在懒惰中沉沦。可是自己如果不经常写的话就会很难写出来，所以接下来要尽量做到每月更新3-4篇文章哦。 我写文章属于心血来潮型，会突然在脑海里闪过很多有意思的文章主题，有的会简单在手机上面记录一下，有的却只是在脑海里闪过，就没有后文了，那么从现在开始来填坑吧！以下是几个有待填起来的坑。 1.我设想中的3D相机2.谈博客的用途3.待续。。。 本篇文章以“新学期，新开始，新期待”为主题，谈谈那些新的东西。 高中的时候每次开学都会有很强烈的氛围，有老师告诉你新学期要继续努力，同学告诉你新学期要更多的改变自己，甚至连教室里放的英语听力都会提醒你，新学期要用新方法学习新教材（高中听英语听力的时候开头经常都会说新思维，新方法之类的，具体记不清楚了…）。而上了大学，老师和同学都很少见面了，英语听力也不用听了，甚至英语课都不用再上了，如果不是自己拼命在心里暗示自己，也许压根就不会觉得这已经是新的一学期了。 接下来说说新的期待咯。 1.减肥并把体重维持到70kg以下2.这学期不能挂科3.如果可以，去谈一场恋爱4.学习一个能够谋生的技能5.还有很多大大小小的坏习惯要各个严肃对待，争取能少一个是一个 这是我第一次给自己列这种详细的列表，希望不要死的太惨，加油gogogo。"},{"title":"Creating Happiness With Computer","permalink":"http://witforest.cn/2016/02/11/creating-happiness-with-computer/","text":"Hello,guys.Do u have a happy lunar new year?Long time no see and I miss you very much.These days I’ve been working with learning php and html and css and so on…I got a certificate of php course.Let’s take a look! Thanks wordpress,I have learned to arrange my ideas and record my life.Most important,I know there are some guys like you are similar to me.Expericed happiness,sadness,success and failures day by day.So I don’t feel helpless and boring,Thx!大家好，春节过得愉快吗？好久不见十分想念。这些天我在学习一些乱七八糟的东西（php，html，css…）我还得到了一个php证书= =此处应有装逼图~谢谢wordpress，我学会了怎么整理想法和记录生活。最重要的是，我发现了一些跟我一样每天经历着酸甜苦辣，成败得失的伙伴。我不会再感到无助和无聊，多谢啦~"},{"title":"年度博客数据盘点","permalink":"http://witforest.cn/2015/12/28/analysis-of-blog/","text":"好吧，其实是因为我也没什么想写的，说实话这一年来也没有写很多的东西。然后呢，这篇文章的创意是因为看了大发的文章，虽然我的博客访问量什么的都没法和他们比，而且说不定这篇文章都没有多少人会看到。算了，不想这么多了哈哈，本来就是个人的空间，玩的开心就好吧。 然后是最近要考试了，自从上了大学，每次考试都是对人生底线的一次刷新，哎一次次的看到自己比以前更差了。曾经以为不会发生的都发生了，而且亲身经历，这也算一种成长吧… 好咯，本博客史上首次盘点正式开始。 首先，一个博客最核心的当然是文章和页面，还有访客。下面就从这几方面出发开始分析。 文章。文章又包括标题，内容，标签。由于这一年期间不断折腾，换主题，换域名，所以百度统计的数据很零散，就凑合着看吧。 首先是最受欢迎文章，这个主要从浏览量，评论数来统计。 恭喜《配置一台属于自己的电脑》成功获奖，这篇自己diy电脑的记录帖获得了最多的回复，虽然有的回复有点不友好。不过没关系，来年继续努力。 值得一提的是，位于评论量第二名的《你要什么》，虽然只有短短的一句话，却意外地引起了许多人的共鸣。看来这个时代情怀的力量还是挺大的，毕竟大家都比较愿意相信心中的美好。不过面对残酷的现实，也要让自己充满力量才行。 ok，下一个是最受欢迎页面。 毫无疑问，《留言》页面以7958次浏览量（截至2015.12.28，这个数据由wp-views插件提供，百度统计里面为261，不过期间数据中断，难以获得真实准确的数据，不再追溯）荣登榜首。不过因为这个页面的特殊性，哈哈，也不足为奇。 值得一提的是，有的页面存在感十分的低，比如音乐和视频，而且没人会在这样的页面停留太久。而关于和链接两个页面之间的访问量相差不多，与留言页面差距也较小。 明年应该会删除掉音乐和视频这两个页面，整合成一个share页面，包括文章，电影，音乐的推荐。然后为自己制作一个作品页面，包括自己的网页（也许会做一个主题呢？），视频，摄影，平面设计（哈哈，这个估计难得）等等这些，总之这一切都要建立在技术更加成熟的基础之上，然后是模仿和学习… 下面是年度活跃读者。 额，由于技术原因，这个数据就靠目测啦。抱歉。。。如果取得了可靠数据，我会在此处更新。 年度活跃读者有：MR.童、MASTER、强哥、 好啦，意淫的也差不多了。宝宝要去准备考试了，博客我们考试完之后再见啦。 mua~"},{"title":"谁不想要安逸的生活","permalink":"http://witforest.cn/2015/12/19/everyone-wants-easy-life/","text":"安逸，简单点说，安逸就是能轻易地得到自己想要的任何东西。具体点，就是吃货可以吃好吃的，旅行家可以玩好玩的，科学家可以实现自己的奇思妙想等等… 而我的安逸生活，就是随心所欲折腾自己喜欢的东西。从零度开水到千樟，从“理解现实，探索未知”到“让思想茁壮成长”，网站即将一周年，变化了很多，唯一不变是一直在变。没有人愿意安于现状，人们都想要改变，却总是缺少勇气去改变。说实话这一路的折腾让我不好受，我也想不这样，希望好好安定下来，安安静静做好需要做的事情。也许更强大的是好奇心吧，所以才会没日没夜的折腾。 折腾的目的不是求虐，而是达到更好的状态。所以有那么多红尘男女苦苦追求一份自己想要的爱情，有那么多吃货走遍天下找寻心中的味道…如果你身边也有这么折腾的朋友，不要试着让他停下来，帮他一把可能还会好点。。。 人生是一条河，我们都在摸着石头过河。不要觉得自己太渺小，每个人都是生命的主宰，所有发生的一切，都有你的影响因素。所以不要光抱怨了，多想想可以怎么去解决吧。"},{"title":"未来，为你而来","permalink":"http://witforest.cn/2015/11/21/future-is-now/","text":"好久不见，我只是来汇报一下近况。 最近这段时间自己的生活相当混乱。很多时候我感觉没有办法控制自己的生活，总是陷入被动。可能自己的决心还是不够深吧，然后太拖延，所以还没把要做的事情一件一件做好，又不得不去面对新的“麻烦”。 标题是三星的一句广告标语，future is now…虽然这句话非常激动人心，不过当前科技成果的实际应用还是很浅层次的，它总是需要通过一个商业化的过程才能更加快速的覆盖到人们的生活当中。然后想谈谈学习，之前一直听别人说我们这个社会很浮躁，那个时候不理解什么是浮躁，也没有感受到那种浮躁的气氛，直到最近我才发现自己也是一个容易浮躁的人。现在很难沉下心去完成一件自己想要完成的事情，总会受到各种各样的干扰。那么解决办法呢，也许是试着远离浮躁的环境吧，远离浮躁的人，和自己喜欢的一切在一起。 可我又担心每个人都有自己的局限，害怕自己看不出自己的破绽…. 关于爱情，有人说爱情是一条河，我们都在摸着石头过河。现在也是感触极深，看着以前班上的同学也有坚持了很久终于幸福的在一起了那种故事。我以前以为我会是那样持久的人，但是其实我不是，我太需要有即时的反馈了。看不到一丝光线的黑暗道路，我不敢去走。 可是生活还是要继续啊，尽管还有四十几天这一年就要完结了，可我还有很多事要去完成。一个月后开始期末考试了，我有很多课程需要复习；最近一直下雨天气很冷，要注意保温不感冒。 我很害怕得不到别人的回应，可是我不得不适应不能时时得到反馈，更不能要求这些反馈都是积极的，我只能一直和自己对话，让自己变得更强大和更加理解这个世界发生的一切。"},{"title":"魅蓝Note2屏幕修复笔记","permalink":"http://witforest.cn/2015/10/29/repair-my-meizu-note2/","text":"[hermit auto=”0” loop=”0” unexpand=”0” fullheight=”0”]netease_songs#:28285777[/hermit]hello，大家好，我又回来了。之前说过的魅蓝note2屏幕修复笔记来了。1、准备工作首先你得有一台屏幕损坏了的魅蓝note2，然后需要拆机工具，包括螺丝刀，撬棒，撬片，吸盘…（我在实际操作中只用到了撬片和螺丝刀）；然后是一块完好的屏幕总成。2、动手时间网上有很多相关的拆解教程，下面我的顺序也只是做一个参考。首先卸下底部的两个用来固定后壳的螺丝，取出SIM卡槽，然后用撬片把后壳四周的卡扣撬出来（实际操作中相当费力，让我想起了以前拆MX2的后盖）；拆下后壳之后就能看到里面的三段式结构了，然后把上面部分外壳的螺丝卸下（注意有的螺丝藏在白色胶带下面，要仔细检查螺丝有没有卸干净）；现在就能看到内部的结构了，去除掉所有的连线，卸下主板和机身之间的螺丝，然后耳机孔，前置摄像头通通去掉，确保主板没有什么羁绊之后，顺利卸下，需要注意的是，屏幕和主板之间还有连线，卸的时候要慢一点；最后就是我们的主角，屏幕了。由于屏幕已经坏掉了，所以拆起来可以随心所欲一点，（不过我的屏幕其实只是外屏碎了，显示和触摸都是完好的，但是这种情况下，单独自己换外框需要很熟练的操作还有其他辅助设备，所以大家还是不要贪便宜，乖乖地换总成吧。）屏幕和机身的中框是用胶水连接的，屏幕总成顶部和底部的胶水比较密集，而两边因为边框比较窄，所以胶水粘性比较小，注意了解以上两点，就能顺利把屏幕拆下来了。后续的步骤就是与上面相反的，在还原的时候不要丢下了任何一个小部件就好啦。3、总结在我看来，魅蓝note2的内部结构还是十分简单的，拆解起来难度也不是很大。不过在操作中一些不规范的动作还是会或多或少的伤害到手机，我的手机后壳就被撬得面目全非了。55555….在现在这个有钱谁都能做手机的年代，各式各样的手机层出不穷。也许未来可以实现每个人都能定制自己专属的手机吧，其实现在已然拥有了这种能力，只是商业运行模式还没有被探索出来。当然，肯定不是所有人都跟我一样有这么强烈的搞机需求。但是真想折腾的话，应该是怎么都挡不住的吧。"},{"title":"我的“搞机史”","permalink":"http://witforest.cn/2015/10/17/gaoji-history/","text":"前两天把用了3个月左右的魅蓝note2屏幕摔碎了，而我十分淡定的去买了外屏和拆机工具打算自己更换外屏。因为在国庆自己也对手上这款魅蓝进行了拆解，发现里面的构造挺简单的，所以才敢这么放心大胆的选择自己维修。拆魅蓝之前先用室友坏掉了的手机练了练手，哈哈哈。说到这个话题呢，就不得不提一提我这十几年的光辉“搞机史”了。从小我就是一个特别爱折腾的人，这一点可以从小时候酷爱玩泥巴，玩石块等体现出来。以及我还记得有一次去上学，书包里背的全是那种可以在地上写字的风化石…在我们的方言里爱折腾的人叫做“千翻”，意思就是会颠覆一些东西吧~ 这是部分被我玩坏过的手机，还有几款因为年代太久远以及各种其他原因没办法上镜了。而我的折腾跟这些手机的阵亡都脱不了干系，hiahiahia~ 故事还得从初中说起，那个时候还是诺基亚当道的年代。不过因为家里不是特别富裕，我自然与大诺记无缘啦。第一部自己的手机是一部山寨机（上图左2），别看是山寨机，但它支持一种叫做mrp的格式的软件，这个秘密我也是在无意之中发现的。我还记得当时是5元30m的流量包，在我没发现可以给山寨机安装软件之前，是完全够用的，但在那之后每个月都会开通额外的流量包。在我发现这个秘密之前，周围的是没有小伙伴发现的。所以我自然而然就成了他们口中的大神，基本上班上很多的手机要安装额外的游戏软件都要先到我的手上“破解”一下，当时自己也是非常开心的，但是当这已经不再是一个不为人知的秘密之后，我也就没那么得瑟了。 接下来来到高中，通过努力的学习，终于家人给我买了一部2000+的大诺记6700s（图中右一）。接下来的又是无穷无尽的折腾，很多学生成绩下降了是因为沉迷某款游戏，而我却是因为沉迷于折腾手机。玩诺基亚的时候就会开始到处去找刷机包，不断刷机尝试新鲜感，而且破解权限也是必不可少的。所以我的手机总会跟别人的诺基亚不一样~ 高中期间另一款手机也不得不说，那就是索尼爱立信w710c（图中左3）。因为这是我接触的第一款支持java的手机。当时在手机上玩修改主题，编辑歌词，修改软件。在今天看起来都还是特别厉害的，现在想起来还会感觉特别有激情。 然后还有另外一款手机，惠普veer（并未出现在图中）。这个手机是palm os的系统，特别的小巧便携，然后也是天天折腾刷系统，想要去实现更多的功能。 再后来终于我接触到了全世界第一款搭载安卓系统的手机，谷歌G1。那个时候安卓2.3以下的系统不支持安装软件到sd卡，所以小内存就特别的尴尬。好不容易后面刷到了2.3，但是内存卡作为一种相对并不廉价的消费品，也是让我无能为力。 然后高中毕业，怀着满心的期待，买了第三部真正意义上的自己的手机，魅族MX2。一开始是被flyme系统淡雅的风格吸引到了，这段时间开始折腾的就变少了，毕竟安卓已经相对比较成熟。不过还是会喜欢没事混混论坛，毕竟要掌握核心科技啊，哈哈哈。 接着是iphone4s，苹果的东西真的给人一种很严谨很紧凑的感觉。用苹果的话自然少不了越狱了。从买来开始我就走上了升级&gt;&gt;越狱&gt;&gt;安插件这条不归路。 而现在的魅蓝note2，开始走上了拆机的路。 我也不知道以后还会开始怎样的折腾，不过我知道，这样的我很快乐~ 期待我的魅蓝note2屏幕修复笔记吧~"},{"title":"照顾好自己，比什么都重要","permalink":"http://witforest.cn/2015/09/17/take-care/","text":"最近在知乎看到一个很有趣的问题：什么叫『低智商的善良』？看完之后我不禁表示默默中枪，答案里面提到的很多行为自己都完全符合，这让我不禁开始思考：“我为什么变得这么在乎别人？怎样才能够不这么在乎别人？”经过这一段时间的观察和思考，我渐渐想明白了。在乎别人，希望别人好。这是一种个人的想法，就像有的人受不了别人比自己好一样。严格的来说，这两种不一样的想法并没有谁优谁劣的区别，只是我们大都喜欢以是否具有第一种思想作为评判一个人道德是否高尚的标准。 对于我而言，我不喜欢用任何的方式来绑架别人。没有谁一定要去遵从某件事情，因此所有规则在我这里似乎都可以被打破。可是如果所有规则都被打破的话，世界将会变得混乱不堪。因此我不得不继续思考：“到底什么是真正的自由？” 我觉得自由是能够不受约束的做自己想做的事，同时承担这件事所造成的后果。 所以我要珍惜这难能可贵的自由，不必强迫自己改变，强迫自己不去在乎。而是需要确定什么事情应该被重视，什么时候应该去在乎。不管结果好坏，能够自我决定就是好的。 说到自己做决定，其实之前我总觉得自己有非常强烈的自我意识。有种瞧不起那些一味附和或者人云亦云的人的感觉。但是渐渐的发现，所谓的我的自我意识，其实有很多部分也是来自于感受到的或学习到的其他人的意识。所以现在我对别人的行为和想法，都抱着很强的敬畏之心。我不能再像之前那样轻视别人的想法，尤其是和自己有差异的思想，这样自我形象也会更加伟岸！ 说了这么多，还是回到题目吧。怎么照顾好自己呢？ 第一，享受自由。第二，在乎该在乎的，不在乎不该在乎的。（至于怎么判别该不该在乎，这是一个史诗级问题，我也不知道怎么解答。如果要我来说的话，就是在乎那些很有可能为自己带来益处的，不在乎那些很有可能会对自己造成伤害的）第三，培养自我意识，知道自己需要什么，不需要什么。喜欢什么，讨厌什么。离不开什么，见不得什么…诸如此类的。第四，和我聊聊天，不妨来这里留下你的见解吧。"},{"title":"推荐几款好玩的游戏","permalink":"http://witforest.cn/2015/07/31/some-games-recommended/","text":"永不言弃 这款由 invictus 制作的休闲小游戏真的可以令人抓狂，因为你稍不小心就可能让你的墨点小人惹上麻烦。首先你可能需要几分钟来适应控制墨点跳跃的操作，接下来就是对记忆力和反应的多重考验，变化多端的游戏场景绝对可以激起你的征服欲望。带上你的墨点小人来征服 18 个地图吧。（我不会告诉我目前还卡在第 8 关的） 配置要求：★☆☆☆☆ 推荐指数：★★★★☆ 支持平台：安卓、IOS 地铁跑酷 很早就开始玩的一款跑酷类游戏，这款游戏由 killo games 公司出品。游戏的玩法跟神庙逃亡差别不大，类似的跑酷类游戏还有特工跑酷，小黄人快跑等。这个游戏的独特之点在于它推出了一个 world tour 的概念，游戏会持续进行版本更新，不断加入新的世界地图和角色。而且游戏的任务系统是不封顶的，这也给玩家带来了极大的挑战热情。如果你有兴趣想试一下的话，千万记得下载官方正版（ ios 版本还好，安卓版的很多国内版本被改的面目全非，所以最好下载官方版也就是英文原版）祝你玩得愉快。 配置要求：★☆☆☆☆ 推荐指数：★★★☆☆ 支持平台：安卓、IOS 狂野飙车8•极速凌云 这个游戏知道的人应该挺多的，毕竟是大名鼎鼎的 GAMELOFT 出品。不知道 GAMELOFT 的童鞋请自行百度吧， GAMELOFT 这家公司可以说真的是业界良心，出品了很多精品游戏，爱玩游戏的你一定不能错过啦。刺激爽快的飙车体验，手机电脑等多平台的完美支持，让这款游戏受到很多人的喜爱。游戏版本的话安卓的分的比较多，可以翻墙的玩家建议下载谷歌官方版。不能翻墙的玩家，可以去百度贴吧里面下载网友分享的最新版本。低配置手机的玩家可以尝试下载低配版或国内版。1个多G的体积或许足够成为很多人放弃的理由，但内华达公路会等着你来挑战。 配置要求：★★★☆☆ 推荐指数：★★★★☆ 支持平台：安卓、IOS、WP、Win 8.1 极品飞车18：宿敌 另一款赛车大作，由同样著名的 EA 公司出品，和狂野飙车不同的是在极品飞车里面强调的更多是真实的驾车体验。你可以选择扮演警察或者车手角色，每种角色有不同的任务，你必须谨慎驾驶，以赚取更多的任务奖励，解锁更多剧情。 配置要求：★★★★☆ 推荐指数：★★★☆☆ 支持平台：PC、PS3、PS4、XBOX 360、XBOX One、Android 真三国无双7：猛将传 由 Koei Temco 开发的一款动作游戏。推荐使用游戏手柄进行游戏，酣畅淋漓的打斗场面，丰富多样的角色形象，让它成为一款可玩性很高的游戏。 配置要求：★★★★☆ 推荐指数：★★★☆☆ 支持平台：PC、PS3、PS4、PSV 英雄联盟 是由美国 Riot Games 开发，腾讯游戏运营的英雄对战网游。《英雄联盟》除了即时战略、团队作战外，还拥有特色的英雄、自动匹配的战网平台，包括天赋树、召唤师系统、符文等元素。 配置要求：★★★★☆ 推荐指数：★★★★☆ 支持平台：PC 漫长假期最带劲的是什么？当然是拉上三五好友“黑”上一盘，别犹豫了，撸起来吧骚年。"},{"title":"“妇联2” 吐槽和想法","permalink":"http://witforest.cn/2015/07/14/feeling-of-league-of-avengers-2/","text":"首先介绍一下观看环境网上下载的枪版，电影版本是在内地上映的国语配音版。配上网友根据英文版译制的字幕，看起来有点不太匹配。 然后介绍下我作为一个男生，对超级英雄的故事自然充满了浓厚的兴趣。看过绿巨人，钢铁侠一、二、三，美队一、二，雷神一、二，复仇者联盟一。算不上一个marvel迷，但是对动漫英雄的热爱从小时候看蝙蝠侠、蜘蛛侠这样的动画片就已经一发不可收拾了。 接下来说说剧情所有的事情都因为那个充满神秘力量的权杖而起，妇联突破层层障碍从九头蛇的残余组织手中夺过了权杖，以为不会再受到这神秘力量威胁时，斯塔克却悄悄的让这个权杖成为了新的威胁，他用它制造了奥创，一系列麻烦接踵而至。妇联必须打破奥创的邪恶计划，阻止奥创毁灭地球的目的。然而在争夺稀有金属的时候，妇联成员被快银和猩红女巫逐一击破，除钢铁侠外全都笼罩在自身的恐惧之下，绿巨人更是为人类制造了许多麻烦，妇联不得不暂时隐藏自己，恢复状态。在鹰眼的私人住所里面，久违的神盾局长出现了，他首先找斯塔克谈了话，然后指引了队长正确的道路。随后妇联重新出发，首先前往寻找赵博士，阻止奥创的进一步计划，在转移思想过程中，快银姐妹发现了奥创的最终目的，背叛了奥创，在一番打斗之后，奥创制造的人体肉身被妇联抢了过来，但是黑寡妇被奥创抓回基地。这时转折点来了，队长没想到斯塔克再次想要把贾维斯的思想植入奥创制造的肉体之内，赶到想阻止，却被后来赶到的雷神促成了肉身和贾维斯的结合，创造出一个不被任何人左右的新奥创，这位新奥创重新让妇联信任彼此，团结一致与奥创作战。最后一战，妇联试图先撤出案发现场的所有人再战，不料奥创将稀有元素埋藏在地下从而将岩石聚合在一起，启动装置将城市不断升高，想要再次上演彗星撞地球。在一番苦战之后，妇联战胜了奥创，并救出了所有人，电影完美结局。 思考一 “人类不需要保护，他们会进化”这句话是美国队长的台词，让我感触很深的是，目前我们生存的环境也正时刻发生着变化，因此不断进步以适应新环境是十分重要的。 思考二 每个人内心都有恐惧的东西，都有容易被攻破的软肋就连超级英雄们都被猩红女巫抓住了心理的恐惧，从而各个击破，更别说平常人。因此不需要害怕自己存在的缺点，而应该有直面软肋的勇气，才会有打败并超越它的机会。 思考三 人与人之间的信任非常脆弱这一点是妇联团队走向分裂最内在的原因，斯塔克不信任队长，所以没告诉他自己的计划，寡妇不敢相信博士，快银和猩红女巫质疑斯塔克。甚至在最后还有一个插曲，是在妇联和奥创的机甲部队作战的时候，军队首领命令士兵停火，不要射击快银和猩红女巫时，一位士兵却开枪射伤了快银。可以说信任危机是现实存在的一个相当大的问题。要让别人信任你，就要打消他对你的顾虑，把真实的自己展示给他。 但即便你对别人披肝沥胆了，也可能会有人不愿意相信你。希望每个人都能学会独立思考，变得更加完善，去信任自己愿意信任，对自己和他人无害的事物。我们都需要别人的信任，我们也都要学会去信任别人。经历更多，学会更多，交流更多，了解更多，彼此的信任才能更多。 吐槽一 中文的译制让影片失去了原汁原味中文配音制作出来后，有一些英文表达的笑话变的很不地道，听起来很生硬。比如有一段，在狂欢晚会上，有一个军官讲他突然出现在某个人面前，翻译上面虽然结合了前一段时间很热的duang，但是没有get到原本的笑点，再跟画面一匹配，简直就像是两只型号不同的鞋子，完全凑不到一起。但是这跟电影制作方关系很大，比如最近看的一些国产电影，里面的笑点都非常的地道。 因此我很不赞成引进版的电影只有中文字幕，中文配音也不是必须的，毕竟文化差异是无法消除的。所以最好的解决方法是像网上一些字幕组压制的电影那样，给出一个参考的中英对照字幕，配音和其他都保持原汁原味，会好一些。 吐槽二 剧本的逻辑有一点小缺陷主要是在奥创刚出现的地方，有人向美队汇报说奥创深入了各个地方，可能比妇联成员都更了解他们自己，然后在后面腥红女巫和快银向奥创介绍他们小时候遭到袭击的时候，奥创好像对这件事情一无所知，后面也没有解释这件事情的缘由。 然后是腥红女巫，在一开始和妇联斗争的时候可谓是凶狠无比，各种抓住妇联内部弱点，逐一击破。但是后来面对奥创的机甲军队的时候，导演却特意安排了一个鹰眼安慰她的画面，腥红女巫又一下变成了胆小软弱，手无缚鸡之力的弱女子。当然啦，这些细节还是不影响这部电影凭借它一波n折的剧情，还有对妇联内部成员各种性格的恰当塑造以及画面与台词的流畅衔接，情节走向节奏的完美把握而成为一部值得一看的电影，电影中一些偶然出现的段子更是引得观众忍不住会心一笑。这部片子吸引人的地方还有大制作的特效，相信钢铁侠那些先进的机甲战队，绿巨人那壮硕的肌肉都能满足那些科幻迷对高科技未来无限的畅想，还有美队雷神高大的身材，也是另一方面的视觉享受。好吧，乱七八糟写的，就这么多啦。 最后我要向疯狂中带着理智、冒险中带着严谨的科学精神致敬！熟悉的地方没有惊喜，相信自己，勇敢的探索未知，同时也要敢于承担责任。"},{"title":"离","permalink":"http://witforest.cn/2015/07/07/goodbye/","text":"有时，离别后会再相逢有时，离别即是永别匆匆一别，未来布满未知我们再不是朋友，甚至你会忘了我姓名你要过你的独木桥，我也有自己的未来 我们终究是要离别的所有未知变成已知，已知变成未知不过都是时间的安排有相遇的意外，就会有完结的必然 别太抗拒，岁月是把无形的刀分别吧，熟悉的地方没有惊喜"},{"title":"博客折腾录","permalink":"http://witforest.cn/2015/07/06/blog-history/","text":"想了想也不知道写什么，干脆记录一下最近折腾主题的事情其实折腾主题是一件相当麻烦的事情，所以我以后应该会去折腾的少一点了，以后钱包够的话直接买一个付费的主题。从折腾的过程中自己也是学到了很多很有用的知识。下面就分享一下我学到的东西吧。 我使用过的免费主题有： 爱在发烧的Forget主题木木木木木的Motify主题JJLin的LifeStyle主题、Dream主题M.J的Presence主题牧风的Arbitrary主题水冷眸的Play-LM主题我很感谢这些高手，让我这个不是很厉害的人可以感受到wordpress的魅力。然后分享一下自己学到的东西： 创建一个页面模板最终效果是，当你在wordpress后台新建一个页面之后，可以在旁边选择它的模板。首先新建一个php文件，比如要创作一个友情链接页面的模板，先新建一个links-template.php（名字是随意的，也可以是其他的）然后在这个文件前面加入 &amp;lt;? php template name: 友情链接 description: a page for links get_header();?&amp;gt; 就可以了，接着需要添加你要在页面中显示的内容content。最后引入你的边栏sidebar，底部footer等就完成了一个页面模板的编写，是不是灰常简单呢。具体案例请看本站友情链接页面 修改wordpress某个页面的代码这个更加简单，你只要知道页面对应的文件是哪一个就可以了。Style.css是样式表，规定了博客里面每个部分的样式。（可以理解成为衣橱，并且每件衣服都有对应的主人）Functions.php包括了博客会用到的功能函数，（常见需要修改他的时候是增加多说的Gravater镜像源）Header.php博客顶部Footer.php博客底部Sidebar.php 博客边栏Single.php文章页面这些页面在wordpress的后台都能修改的，不过有时候你需要修改的可能不只是这些页面，这时候就需要自己耐心找找啦。好的，教程完毕，就简单写这么多了。高手请自行略过，我知道这些都是很基础和简单的。如果你还有很多不明白的，多多去问百度吧！还有一件事，域名还有30天就到期了，到时候亲们记得可以用witforest.cn继续访问本站哈。"},{"title":"你要什么","permalink":"http://witforest.cn/2015/06/05/make-a-target/","text":"看不清自己，看不到自己到底想要什么。我需要有一个人生的目标！"},{"title":"我们眼中的世界","permalink":"http://witforest.cn/2015/05/31/the-world-in-our-eyes/","text":"我们生活的世界本质上应该是一样的，但是不同的人眼中看起来却是大不相同的。一个最直观的例子就是近视的人和不近视的人眼中的世界。 所以世界才会有那么多独一无二的个体，有着那么多各不相同的想法，差异让这个世界更美好，但是同时也给我们带来了一些麻烦。 我以前会认为每个人都是善良的，他们会喜欢同样的东西，天气冷了就穿厚衣服，天气转热就少穿一些。后来才慢慢发现，其实这只是自己在内心的一个缩影。其他人当然可以有自己的选择，他们可以不必对每个人都态度友好，可以有自己的私心（我自己也有），可以去做自己认为正确的一切，没有什么东西会限制他们去拥有自己的特点，因为世界会包容这种不同，这是每个人生活的地方，它不会差异对待任何人。 在这世上摸爬滚打得越久，就会越感受到这种美好但有时候又令人烦恼的差异性。美好的是这种差异性能让自己接触到不同的性格和习惯，这会让我一直保持新鲜感，可以一直进步和完善。烦恼的是差异必然会导致矛盾和冲突，不同来源的人有着不同的文化信仰和生活习俗，而当他们走到一起的时候，冲突就很容易发生了。我却是很不希望看到矛盾和冲突的，不过自从明白了这也是世上不可避免的一种存在之后，也能欣然接受了，只是但愿冲突的双方会抱着一个美好的平和的目标来解决问题吧。 也许正如身边的朋友所说，是我太过认真，生活里面其实并不是到处都充满了这么多条条框框和规则。有的时候我们也要试着跳出自己的思维定式，去看看别人的桃花源是什么样子，闻一闻那里的花香，看一看那里的美景。 那我们世界到底该是什么样的呢，这其实是一个没有标准答案的问题。 之前看过老罗的话，大概意思是说每个人从出生开始就注定了将要改变世界，因为他的出生就已经改变了这个世界。然后他讲了一些例子，类似看见身边的人做坏事，自己不去跟着做，就让这个世界少了一件坏事这样的。所以我们总把改变世界挂在嘴上，但其实我们无时无刻不在影响着世界，随时都会让它变好一点或者变坏一点，这样说的话，是不是会觉得自己其实很可怕呀~ 所以我们还是会继续用自己的双眼观察这个世界，看它的日出日落，看它的斗转星移，到最后也许我们也都会变成银河里面那一颗颗微小的星星吧。 可是，谁又能够发现哪颗星星是你呢？"},{"title":"我是你最坚实的铠甲","permalink":"http://witforest.cn/2015/05/14/to-be-independent/","text":"The larger the ego,the less the need for other egos around. 自我意识越强大的人，越不需要他人的陪伴。 The more modest and humble we feel,the more we suffer from solitude,feeling ourselves inadquate company. 我们越感觉谦逊和卑微，就越是受到孤独的折磨，感觉自己没有得到足够的陪伴。"},{"title":"配置一台属于自己的电脑","permalink":"http://witforest.cn/2015/05/03/diy-your-pc-2/","text":"一个月之前我的笔记本坏掉了，它已经陪我走过了差不多四年的时间，纪念一下。（我能说笔记本现在复活了吗 update 2015-9-10）而我首先想到的就是自己配置一台，因为这样性价比更高，相应的缺点则是体积比较大，不方便携带。2015年4月13日，新电脑配置完成。首先看看我的电脑配置： 这里最主要的部件有四个：CPU、主板、显卡、显示器（声卡和网卡都集成在主板上面），硬盘是之前笔记本的硬盘，内存直接买一条就行，这里没有显示的还有机箱、电源、cpu散热器、键鼠、音响。这样说着也许有点抽象，先看看这些主要部件都长什么样子吧。 显卡CPU主板 不同型号的配件外观不一样，请以实际为准。看了这些呢，我们对一台电脑的构成什么有了一个大致了解，下面先进入配件的选购。配件选购： 在选购配件之前首先要明确自己的预算，了解自己更看重性能还是外观，以及配置电脑的用途。 看重性能的朋友，需要对各个硬件的参数比较了解，在机箱的内部配件上需要多费工夫； 看重外观的朋友只要选好机箱、显示器、键盘鼠标等外设，接下来只要选择支持的其他配件就ok了。好的，接下来介绍具体的流程。看重性能的朋友选购时最需要注意的是CPU和显卡，这两个对电脑性能的影响至关重要，也是配机当中最昂贵的部分。选购的时候，可以参考最新的以及，然后根据自己的经济实力选择对应的配件，有需要时也可以选择购买矿卡。选好这两个部件之后，其他的部件基本上就是确保支持cpu和显卡就可以了。特别是选购机箱时，一定要考虑到显卡的长度。我就因为是第一次购买机箱，所以长度不够，只好对机箱进行了强行改造才组装好。其次，要选择功率足够的电源。主板上的话，就看自己的扩展需求，比如需要几个内存插槽这样。看重外观的朋友首先需要选购的则是电脑的外部硬件，比如机箱，显示器，键盘鼠标，音响等，选购建议的话，引用一句锤子手机的广告语吧。“对于美的分歧，只存在于非专业人士中”。貌似不是很恰当，但我就想说，选择你喜欢的就行了，因为每个人审美不完全一样。对于其他硬件的选购就跟上面看重性能的朋友差不多了，只要能支持到的就ok。最后，如果你既喜欢美美哒外观，又看重电脑的性能，还希望能以最少的钱买到，那就需要多做尝试了，或者与我交流，也许我能帮上一点忙。动手组装：在你千挑万选，终于选出了自己需要的配件，并且已经把它们买到手上的时候，动手的机会就来了。 组装过程中最复杂的是主板和电源，因为上面有很多连线和插槽，而且主板附带了很多不同的螺丝。 这时要保持冷静，先观察主板的结构并阅读说明书，了解什么插槽是用来安装什么的。 对于电源也是类似的，需要注意的是电源一般没有多余的插口，而且电源上比较大的插口是很容易插好的。 连接所有线的时候都要小心细致，不能用力太大。 电源有很多接头 下面开始具体的流程（顺序不一定，请根据实际情况自行调整）：安装主板：把主板装进机箱，在机箱背后留给主板上的插口的开口上需要垫一块铝片（主板附带），在主板与机箱之间需要提前安上黄色的螺丝安装cpu：注意cpu的位置不要对反了，接着装上cpu散热器，并接上主板上为散热器供电的插槽安装内存：找到对应的内存插槽插入内存，直到锁紧安装硬盘：连接硬盘，首先把硬盘装到硬盘架上面，将硬盘连线一头接硬盘一头插上主板相应位置安装前面板连线：机箱前面板连线接上，这里接线比较复杂，不过在主板说明书上有对应说明，对照着接上安装显卡：插上显卡，注意要先把机箱背面的卡扣打开，插入显卡之后拧上螺丝，关上卡扣安装电源：把电源安到机箱上，先连接上较大的连线，然后接上硬盘及显卡的供电线，仔细检查所有连线接好后，组装的工作就完成了最后的最后，连接好显示器，键盘鼠标，音响和电源，开机享受你的新电脑吧。 本文写的比较仓促，对文中的不足还请读者谅解，另外由于硬件各有不同，所以本文仅作为一个参考，具体的装配教程可以网上搜索，如果对本文或者配置电脑有任何疑问，欢迎你和我联系。谢谢。"},{"title":"毕业前，你还来得及做的50件事","permalink":"http://witforest.cn/2015/04/20/50-things-before-graduate/","text":"时光是一个小偷，偷走了我们的青春，我们的狂妄。 四年前那个提着行囊走进这个陌生校门的我们，即将提着行囊走出这个熟悉的校门。 这四年得到了什么？又失去了什么呢？是不是有很多事要记下来，有很多话要跟自己说？ 说句“我走了”多么容易啊，可是，却又是那么难；说句“再见”多么容易啊，可是，真的能够再见吗？ 我们带泪带笑说珍重，我们真的不愿意说再见。 1、在个人电脑上新建一个叫“关于毕业的一切”的文件夹，再建一些子文件夹，照片、视频、歌曲、文章等等，把所有毕业期间的东西全部收集在里面，最好再做一个备份在网盘上防止丢失。 2、准备一个防潮的小箱子或盒子，拿它用来装留有大学痕迹的所有实物，比如纪念册、签名T恤、纪念照。 3、买一件价廉物美的白色T恤，让每个同学都在衣服上签名，珍藏起来，想念的时候拿出来闻一下。 4、做一副扑克牌，精美程度因人而异。用上每个同学的照片，还有一些大学生活中有代表性的聚会、郊游、上课时的照片。若干年后，拿出来看会有感觉的，真没感觉了，用来打打接龙也不错。 5、让自己当一回超级布景板，和每个熟悉的人拍一张合照。在酝酿的时候你尽可能多罗列一些可以合影的对象，人物可以是上下铺兄弟姐妹、喜欢的老师、食堂大娘、宿管阿姨······然后在社交网站建个相册，名字叫“我思念的青春”，或者叫“路过我青春的人”。当然，你还可以有更好的名字。 6、穿学士服拍张照。介个，没什么可说的，能拍多少张就拍多少照，拍到别人的手抽筋为止。 7、离校前，不要特意收拾自己的床，平时怎么滴就怎么滴，然后给它拍几张特写，虽然有点土，但有意义。 8、感谢一下所有的老师，不管那老师是你喜欢的，还是你曾经捉弄过的，准备一个好看点的本子，最好让这些老师每人都给你写一句忠告，记得一定要是忠告，这些忠告以后你会觉得很有用。 9、男生穿上西装，女生穿上OL一点的衣服，和一帮兄弟姐妹在校园里留个影，比如校门口、花坛前，你会发现很多感觉不一样。 10、如果非得要赶在毕业照之前换个发型的话，最好提早下手，给自己充分的时间习惯，不然理发师一个不小心，你哭都来不及。 11、尽可能把自己动过“小手术”的课本、上课传过的纸条保存起来。 12、和自己的姐妹或哥们相约去拍一套属于你们自己的写真集。N年以后还是这帮人还是这个姿势重新拍一套，也许你们会红哦。 13、和真正的朋友做一次最坦诚的聊天，分别指出彼此最大的缺点，提出最直接、最中肯的建议。恩，这件事比较有意义。 14、好好组织或参加毕业晚会的演出，这段时间同学们都各忙各的，组织毕业表演这件事情很难，但一定要有人站出来，错过了毕业表演会遗憾的，最好是动员全班同学都上台。 15、如果到这时候你还是没有在校友录上找到组织的话，赶紧加进去，你会发现已经有很多人在等你。 16、再去图书馆借一次书，看一会报纸、杂志，哪怕在那里发发呆也好。进入工作状态以后，这样的机会真的很少了。 17、除非学校逼着你归还所有的证件，否则不妨把学生证留起来，以后买火车票或许还能充充数打个折。 18、留下每一个你觉得以后还想联系的朋友的手机号码、QQ号码、微信账号、微博账号等一切可以留的号码，该加好友的加好友，该加群的加群，该关注的加关注，当然也得把你详细的联系方式发给他们，越详细越好。 19、认真的写一篇作文，题目就叫做《我的大学》。作文可以放在自己的QQ空间里，或者其他网站里。 20、那个校徽，死活都要留着，以后告诉你爱人和你的孩子，你乃一介某某大学毕业生。 21、找到你喜欢的男生（女生），或直接告诉或发短信告诉—我喜欢过你。如果不敢表达，那么这个人的照片你必须得留一张，要不到写真，手机偷拍下来也可以。 22、平时乖乖的小清新女孩，可以找几个男生陪着，去找那些矮点的围墙，认真的翻一次吧。最好，还是穿裙子，这可是最后的放肆。 23、要毕业了是不是很有砸东西扔东西的冲动？组织一个枕头大战不错诶，整个毕业泼水节出来也行。 24、在全班同学面前再做一次自我介绍：hi，大家好，我叫某某某，然后眼泪夺眶而出，最好请人把这一段拍个DV出来。 25、向自己一直没有勇气道歉的朋友说声“对不起！”，还有，顺便跟你讨厌的人说“再见”。 26、学会张震岳的《我会想念你》，在校园里放声高歌。 27、再体验一次校园里的特色项目，比如去许愿树写下自己的愿望，听食堂播放的校歌，去校园电影院看一次电影，可以通宵的最好。 28、在校园内找一棵长的好看的大树，在树下挖个坑，在一张漂亮的纸上写上自己的名字，埋进去。若干年以后带自己的爱人故地重游，这里绝对就是一个景点，对，就像韩剧里演的那样。 29、散伙饭可以重头戏。一定要喝些酒，至少也得微醺吧，或许有人会喝醉，不过，别担心，会有三五好友把你拖回来的。醉酒是什么感觉呢?听说会很难受，头会很痛。不过，人生也没几次大学毕业，豁出去试一次吧，大家也可以理解，千万记住了，酒后别开车。 30、听一场校园演唱会，去捧一下音乐系同学的毕业演出也可以，表现得嗨一点。 31、去校外小餐馆聚餐的时候向老板要张发票。抬头就写“某学校某系某班”或者“某某寝室”，让店老板记得写上具体时间，如果能附上菜单更好，并指定某位同学保存起来。 32、瘦的人争取在这段时间前把自己养胖点，因为工作后会很辛苦，要提早储蓄脂肪以备不时之需。 33、在夜黑风高的时候，爬一下学校周边的山，爬到山顶的时候，支起烧烤架，来个BBQ。额，学校周围倒是真没什么山。 34、找到你最不喜欢的那个食堂，品尝一次那里的饭菜，它的味道会成为你很多年后的焦点谈资之一。 35、趁回家的时候给全班同学每人带一些自己家乡的特产，吃人家的嘴软，总会有一些人记住你的。 36、选择一个常去的餐馆，把所有的菜都点下来，请同学们吃大餐。菜全部端上来后的壮观场面一定要拍下照片。 37、认认真真完完整整地将自己在学校经常消费的地方做一次总结性的踩点，校园周边那些好吃的小店分步骤分批次地再光顾一遍，和关系好的店主顺便告个别。看似无关紧要的那些人其实也是你大学记忆中的一分子。 38、记下校园好友的生日，并在手机里设置提醒，在ta生日的时候发条短信，最好选凌晨零点发送，ta会激动的。 39、寝室的兄弟或姐妹来个约定，每年找个主题找个城市聚会一次。 40、和寝室的兄弟或姐妹买一样的衣服，然后霸气地几个人在街上走一遭，看看那个回头率到底是有多高。 41、和室友给寝室来个大扫除，留下一个崭新的寝室给学弟学妹。有用可以拎走的东西打包回家；有用却拎不走的东西，可以在宿舍外面来个跳楼大甩卖；没用可以拎走和既没用又拎不走的东西直接送给废品回收站好了。 42、找几个要好的朋友玩最后一次真心话大冒险，问题问得越刁越好。 43、在操场上等着看一次日出，看一次日落，前提是学校保安能同意。 44、有校园恋情的同学，不管是继续还是分手的，你们俩都应该手牵手地气氛和谐地在校园溜达几个圈，不过不提倡拍过分亲昵的合影，艳照什么的更要禁止，避免日后引起不必要的麻烦。 45、借一辆自行车踩遍校园的角角落落。 46、最后在寝室打一次撸啊撸，High战到天亮。 47、摄影技术好且PPT技术好的同学不妨把校园毕业前的各种校园活动的资料做成一个专辑，供同学免费保存，毕业前就当为大家作件好事。 48、记着去送一送先你离校的每一个同学，记得和他们拥抱一下。这招有点催泪，记得准备好纸巾~ 49、离校最后一刻给自己拍下站在宿舍门口、站在校门口的照片，并写上具体的离校时间，最好记下精确到几分几秒。离校那一天的细节最好也一一记下，配上当天的天气和心情。 50、和全班同学来个十年之约，比如选择2027年的9月1日，碰头地点是校园正门口，接头暗号是唱一句陈奕迅的《十年》。为消灭贫富差距，保养好坏差距，硬性规定大家一律坐公交车过来，而且只能穿白衬衫加牛仔裤。 注：文字转载自网络，部分内容有改动。 PS:然而事实上一件也没做成。。。"},{"title":"我都做了些什么","permalink":"http://witforest.cn/2015/04/14/recent-things-2/","text":"恩，距离上一篇更新已经有一个月左右了。而且前几篇文章都不算很认真的在写，今天我也来更新更新，说说最近在干什么事情。我的更新并不频繁的原因有几个： 一、我比较懒，有时候有空余时间也是在玩游戏或者干其他事情了； 二、我个人的文字写作能力不强，每次的文章都要反复修改很多遍才能达到自己想要的效果； 三、我对时间的分配不合理，其实我根本没有规划过自己的时间，而且就算规划了也很难去按着做。 所以，我希望通过培养定期写博客，养成自己良好的时间管理习惯。 好了，进入正题。在这一个月左右的时间我都干了什么呢？好好地思考一下这个问题也算是对自己的一种交代吧！ 3月6号才来到学校，8号就开始学科目二，所以接下来的三个周末都是在驾校度过的。所幸的是已经通过了科目二的考试，可以不再为它操心了。在学科目二的过程中有许多感悟，主要是因为科目二的教练脾气太过于暴躁，在他面前练车压力相当的大，后来回到学校跟同学抱怨之后，同学给我出了一招。于是第二天我就带着一包烟来到驾校塞给了教练，果然那一天教练都没有再对我们发出太大的脾气，这其实令我非常意外。 因为在我的心里，我总觉得每个人都是一样的，善良、朴实、勤劳等等，但是自从我越来越长大之后我才发现，我一直把自己的影子投射在别人的身上。这世上的每个人分明都是不一样的，无论是外形还是内在，而我们只能够在生活中求取共同的地方，尊重互相的差异。这一认识的发展也算得上是理解现实的一大进步吧，经历的越多，才能对现实理解的更加深刻。不过话说回来，塞烟这样的方式也只是一种圆滑的处事方式，其实是对世界的妥协。毕竟很多时候，要迎合一个人是非常简单的，而往往难得的是要教会他去改变，去理解他真正需要的真善美。 最后提示一下需要学车的朋友们，记得要和教练搞好关系，最好报名直接找教练，这样以后练车教练会对你好一点。如果碰上态度不好的教练一定要及时换，除非你能忍住或者舍得花钱给教练买烟。 好了，接下来是关于学习的部分。感觉自从到了大学，学习的目标从以前的考上一所好大学转变成了找到一份好工作。可我在大学一直觉得学校的教学特别的水，几乎所有的课程都是完全靠自学才能过关的，这样的迅速转变让一些像我这样没有自我管理能力的学生没有时间及时来适应，因此我现在感到无比的压力，真的就像那话说的：“并不是我们上了四年大学，而是大学上了我们四年”。 但是到了毕业的时候，很多企业对于在大学里面学习成绩优秀的学生党认可又是有限的，他们更关注的是大学生的社会经历，看重他们的综合素质和个人性格这样的实际上难以具体量化的概念。之所以难以理解上大学的意义还有原因，比如觉得在课堂上面学习的知识有可能跟不是时代发展的步伐，大学里面有的课程更是形同虚设一样。但是通过在大学的学习，我们还是能够收获友情啊爱情这些，或者是养成了独立学习的习惯，培养了自我管理能力等，这又是大学能够带给我们的。 最后说一下社团的活动，开学后就开始着手准备社团的活动了，我主要是要制作宣传视频和网站，尽管听上去还是很高大上的，但是实际上我做的也只是模仿是修改别人的模板而已，但是社团确实让人忙成了狗。我觉得在社团里面还是要多跟别人沟通，这样才有利于问题解决。有时候我是很希望能多跟别人说话的，只是自己会很羞涩或者不知道怎么表达自己， 好吧，先就扯这么多。接下来还是要继续理解现实，探索未知。 &nbsp;"},{"title":"改变世界","permalink":"http://witforest.cn/2015/03/30/fight/","text":"这个世界，还有很多东西等着改变。为了改变这个世界该改变的而奋斗吧！"},{"title":"春日甚好","permalink":"http://witforest.cn/2015/03/27/beautiful-spring/","text":"残梅时节一过，就到了樱花盛放的时刻。 风在摇它的叶子，草在结它的种籽，春色正好。 寻一人伴侣，羊山湖风筝，鸡鸣寺樱花，玄武畔长城，如此正好。"},{"title":"面对现实","permalink":"http://witforest.cn/2015/03/20/be-yourself/","text":"我们都知道自己心里满满的在乎别人对自己的看法，却还要说着“走自己的路，让别人说去吧”这种连自己都不会相信的鬼话。"},{"title":"傀儡","permalink":"http://witforest.cn/2015/03/17/not-youeself/","text":"月光零碎照在你的背湖边有风在吹桥上我的诉说你不理会你总说人言可畏自己却又似是而非这是所谓的爱情还是你要的暧昧 曾经以为我不会疲惫陪你到大雪纷飞看着斜阳落下红色的泪所有生命都沉睡我也不再爱你宝贝和你只是一场宿醉和你只是一场暧昧 她是蔷薇露珠是她抖落的泪一半在风中挥洒一半在叶上憔悴她不是玫瑰不懂离别和心碎又怎么知道我只是个美丽又忧伤的傀儡 冰冷的时钟积淀着记忆的灰残缺的屋檐滴下雨水在梦中你没有枯萎我也闭上了诉说悲伤的嘴"},{"title":"没有童话","permalink":"http://witforest.cn/2015/03/16/no-fairy-tale/","text":"阳光一动不动 我就这样安静的在风中撞见你的笑容看见你灰褐色的瞳孔你有我喜欢的长发也说着我想听的话可是我不知道你比我想象的复杂 十八岁的雨季我的诗句里全是你的样子那时你沉默不语让我觉得爱无路可去我决定当一个哑巴在没有你的世界说话我比你傻不懂该怎么接受他 爱情如此荒唐你还一直说谎说你的爱在北方说你要把持住欲望生活不是童话没有大雨落下没有你的优雅更没有人施舍鲜花"},{"title":"我的2014年终总结","permalink":"http://witforest.cn/2015/02/26/to-2014/","text":"每一年，数不清的人在做着年终总结。虽然每个人的总结都不一样，但相同的是，我们都在总结着过去，期许着未来，希望能够踏踏实实走好脚下的路。 一、干外婆去世干外婆生活在一个叫双河的地方，在我印象里面，她是一个特别平易近人的老年人，上次见她时，她双脚已经不能走动，但是对我还是特别热情，之前她每次都做家里最好的东西招待我。然而为外婆葬礼置办物品时，才发现我竟然连外婆的姓名都没办法完整正确的写出来，当时我觉得特别尴尬，只有打电话问妈，结果她也不确定。= =生活中就是这样，我们跟很亲近的人也没有做到充分的沟通。 二、外公去世那时我在学校上学，没能见外公最后一面是一大遗憾。我的外公是一个特别和蔼可亲的老人，每次见到我他都笑得合不拢嘴，他也是我了解的少有的能没有障碍自己读书的老人，但是我不是很清楚他平时念的是什么书，不过从他身上我学到的是求知精神。这种体会跟光读书本上的案例是不一样的，这样的人物让你的体会很真实，很难忘。说到外公，就还要再提一提外婆，外婆虽然在我很小的时候就去世了，但我脑子里一直有一个她在家门口等着我跑过去抱我的镜头，跟电影一样，在脑海里抹都抹不掉。更神奇的是，外婆去世后，我还做过噩梦，我想可能是我对外婆真有难以割舍的感情吧，尽管现在我连她的样子也记不清了。 三、老妈查出子宫瘤今年夏天，真能称得上是多事之夏了。暑假的某一天，妈在涪陵医院被检查出了子宫肌瘤，遂开始住院。在医院静养几天之后，医院对她进行了手术。但是在肿瘤还没有彻底切除干净时，主刀医生告知我们说妈妈血糖升高，不能继续手术。手术结束之后，妈妈被送进了重症监护室。一听到这个消息，我大爸和其他亲戚特别紧张，特别担心妈妈出现什么问题，我也不知道当时我是怎么回事，特别平静。当时我想着要相信科学，用科学治疗方法就没什么问题的，还一边这样安慰那些亲戚。后来，妈妈从重症监护室出来，一切正常，平安无事。大家的心才放了下来。然而后来的大麻烦才刚刚开始。妈妈在家里一直不舒服，直到我去上学都是这样。后来在另外一家小医院查出了原因。原来之前那家大医院手术的纱布在里面没取出，这么一个小问题却一直困扰了我妈几乎整个夏天。很多时候我们十分肯定的事情更容易出岔子，所以对待事情要认真严谨，不能骄傲自大总结起来就是：我在2014遇到了很多事情，有难过的，当然也有开心的。这里写这几件只是我正好想到了，就写出来了。不管怎样的事情，总是让我不断地长大，不断地懂得。时间永远都是公平的吧，失去和获得，开心和难过，他都能给你。 接下来，我要学好专业知识！！！大一和大二，学业近乎完全荒废。现在懂得，大学教你的知识，是在帮助你以后更好地养活自己，所以是不能掉以轻心的。 然后，我还会把博客更新下去尽管很少人看到，但这里现在已经成了我的一个好伙伴，我能对他说出心中的感受，很开心。1.而且没人来的好处是我可以随便什么时候更新，我也不必给自己定什么标准。2.试过去自己创作主题了，发现那需要一整个系统的学习，因此我抛弃了这个念头，转而决定修改现在在用的主题。3.视频转载已经在路上了，我只是还没专心下来弄！"},{"title":"收集一些个人非常喜欢的博客","permalink":"http://witforest.cn/2015/01/05/nice-blogs/","text":"咚門 | 牧风 | M.J | Me.稀奇 癖事 | 沫 | 设极 | 爱在发烧 玉在河里 | Fourseven [hermit auto=”0” loop=”1” unexpand=”1”]netease_songs#:5312840[/hermit]"},{"title":"关于LOL的一些思考","permalink":"http://witforest.cn/2015/01/05/thoughts-about-lol/","text":"最近看到一个LOL赌局的新闻，双方用一万块钱作为赌注打比赛，就因为在游戏里面双方产生了争吵。 最近也感受到很多玩家少了对游戏的投入，更多的是无谓的指责。也许是输得太多，想赢的心情可以理解， 但是我想说指责其实一点都不利于赢得比赛。我们需要做得更多的是思考怎么去改善，才能得到自己想要的结果。"},{"title":"世界，你好","permalink":"http://witforest.cn/2015/01/03/hello-world/","text":"很高兴你来我的博客，并看到这篇文章。这是开通博客后写的第一篇文章。现在这个博客勉强还能访问，我尽力坚持完善这个博客，丰富自己的网站知识。"}]}